var mixin_rpt_tooltip = {
    data: {
        home: [
            { 't': "銷售分析", 'dsec': '此圖可以查看企業銷售額及銷售量的長期走勢' },
            { 't': "熱門分店總銷售", 'dsec': '此圖可以查看前十二排名的分店及銷售額' },
            { 't': "熱銷商品", 'dsec': '此圖可以查看企業熱銷商品的客單價、交易數、銷售量、銷售額' },
            { 't': "回購次數佔比", 'dsec': '此圖可以查看某時段內會員回頭購買的次數比例' },
            { 't': "首購與回購佔比", 'dsec': '此圖可以查看首購及回購會員的比例' },
            { 't': "熱門時段", 'dsec': '此圖可以查看一星期內哪一個時段比較多交易發生' },
            { 't': "會員交易間隔分析", 'dsec': '此圖可以查看會員隔多久回來購買商品' },
            { 't': "客單量 x 客單價 x 銷售額", 'dsec': '此圖可以查看各分店的客單量、價大多集中在哪一個範圍，哪些分店表現特別好或特別差' },
            { 't': "性別佔比", 'dsec': '此圖可以查看企業會員的男女比例' },
            { 't': "年紀佔比", 'dsec': '此圖可以查看企業會員各年齡層的比例' },
        ],
        rpt: [
            { 't': "門店銷售分析", 'dsec': '此圖可以查看企業銷售額及銷售量的長期走勢' },
            { 't': "長期銷售走勢", 'dsec': '此圖可以查看企業銷售額的長期走勢' },
            { 't': "會員數走勢", 'dsec': '此圖可以查看企業會員數走勢以及增加的人數' },
            { 't': "NESL會員走勢", 'dsec': '此圖可以查看企業會員的活躍度，新客、主力會員越多越好' },
            { 't': "NESL會員變化走勢", 'dsec': '此圖可以查看企業會員的入睡、喚醒的人數；入睡的人越少越好，喚醒的人越多越好' },
            { 't': "RFM會員人數分佈", 'dsec': '此圖可以查看企業會員的在指定時段內消費的次數，金額分佈，以及最近一次距今多少天沒來了狀況' },
            { 't': "自訂會員RFM人數分佈", 'dsec': "此圖可以跟據會員於建置CDP初期，對RFM各數值指定一個低中高的數值區間，<br/>例如一個月消費４次以內代表「低」。依此定義查看各數值會員人數的分佈。" },
            { 't': "熱銷商品", 'dsec': '排名前五十名的熱銷商品及其銷售額、銷售量' },
            { 't': "回購佔比走勢", 'dsec': '此圖可以查看時間段內的每一天或週、月的回購分佈，回購次數越多的會員比例越多越好' },
            { 't': "回購間隔(天)佔比", 'dsec': '此圖可以查看某時段內會員購買間隔的天數' },
            { 't': "首購人數/回購人數佔比", 'dsec': '此圖可以查看某時段內會員回頭購買的次數比例' },
            { 't': "熱門時段", 'dsec': '此圖可以查看一星期內哪一個時段比較多交易發生' },
            { 't': "關鍵商品銷售瀑布圖", 'dsec': '此圖可以查看各個不同的關鍵商品之間銷售佔總銷售額的比例' },
            { 't': "各通路會員消費走勢", 'dsec': '一次查看全部分店的消費會員數、交易數、銷售額的走勢' },
            { 't': "熱銷商品會員消費走勢", 'dsec': '一次查看全部商品的消費會員數、交易數、銷售額的走勢' },
            { 't': "每小時銷售分析", 'dsec': '此圖可以查看各時段的消費會員數、交易數、銷售額' },
            { 't': "年度銷售報表", 'dsec': '此圖可以查看一整年每一天的銷售額，可以看一整年淡旺季、一週內的熱消星期' },
            { 't': "簡易會員終生價值", 'dsec': '此圖可以查看會員的終身價值，是計算會員與商家維持買賣關係的時間內的淨收益貢獻值' },
            { 't': "付費類型走勢圖", 'dsec': '此圖可以查看顧客的付費類型總額的走勢' },
        ],
        account: [
            { 't': "帳號列表", 'dsec': '請在此新建或修改貴公司的帳號' },
            { 't': "設定角色", 'dsec': '你可以在此新增貴公司的角色，並選擇此帳號所需的權限' },
        ]
    },
    methods: {
        get_rpt_tooltip(where, rptName) {
            serach_rst = ''
            switch (where) {
                case 'home':
                    serach_rst = this.home.filter(r => r.t == rptName);
                    break;
                case 'rpt':
                    serach_rst = this.rpt.filter(r => r.t == rptName);
                    break;
                case 'account':
                    serach_rst = this.account.filter(r => r.t == rptName);
                    break;
            }
            return serach_rst.length ? serach_rst[0].dsec : '';
        },
    }
}